In [41]:
import pandas as pd

In [42]:
df = pd.read_csv(r"http://bit.ly/drinksbycountry")

In [43]:
df.drop('continent',axis=1).head() # Axis 1 is for Columns
df.drop([0,4,3],axis=0).head() # Axis 0 is for Rows
df.country = df.country.str.title()
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [44]:
# Using string methods on a dataset
df = pd.read_table(r"http://bit.ly/chiporders")
df[df.item_name.str.contains("Chips")]
# It's possible to chain methods
df['choice_description'] = df['choice_description'].str.replace("[","").str.replace("]","")
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,Clementine,$3.39
2,1,1,Nantucket Nectar,Apple,$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"Tomatillo-Red Chili Salsa (Hot), Black Beans, ...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"Fresh Tomato Salsa, Rice, Black Beans, Sour Cr...",$11.75
4618,1833,1,Steak Burrito,"Fresh Tomato Salsa, Rice, Sour Cream, Cheese, ...",$11.75
4619,1834,1,Chicken Salad Bowl,"Fresh Tomato Salsa, Fajita Vegetables, Pinto B...",$11.25
4620,1834,1,Chicken Salad Bowl,"Fresh Tomato Salsa, Fajita Vegetables, Lettuce",$8.75
4621,1834,1,Chicken Salad Bowl,"Fresh Tomato Salsa, Fajita Vegetables, Pinto B...",$8.75

In [45]:
# Changing Data Types
df = pd.read_csv(r"http://bit.ly/drinksbycountry")
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [51]:
# Changing the Data Type before
df = pd.read_csv(r"http://bit.ly/drinksbycountry",dtype={"beer_servings":float})
# Changing the Data Type after
df.wine_servings = df.wine_servings.astype(float)
# Boolean to Int to work with Machine Learning
df.country.str.startswith("A").astype(int)
df.dtypes

0      1
1      1
2      1
3      1
4      1
      ..
188    0
189    0
190    0
191    0
192    0
Name: country, Length: 193, dtype: int32

In [61]:
# GroupBy

df = pd.read_csv(r"http://bit.ly/drinksbycountry")
df
df.groupby("continent")['beer_servings'].mean()
# For each continent - Show the sum of beer servings
df.groupby("continent")['beer_servings'].sum()
# The .agg method is OP
df.groupby("continent")['beer_servings'].agg(['min','max','count','sum','mean'])

df.groupby("continent").sum()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
Africa,AlgeriaAngolaBeninBotswanaBurkina FasoBurundiC...,3258,866,862,159.4
Asia,AfghanistanBahrainBangladeshBhutanBruneiCambod...,1630,2677,399,95.5
Europe,AlbaniaAndorraArmeniaAustriaAzerbaijanBelarusB...,8720,5965,6400,387.8
North America,Antigua & BarbudaBahamasBarbadosBelizeCanadaCo...,3345,3812,564,137.9
Oceania,AustraliaCook IslandsFijiKiribatiMarshall Isla...,1435,935,570,54.1
South America,ArgentinaBoliviaBrazilChileColombiaEcuadorGuya...,2101,1377,749,75.7